bit-finance/InformationRegisters/бит_УдалитьНазначениеПравилЗаполненияПриТрансляции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_УдалитьНазначениеПравилЗаполненияПриТрансляции</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПравилоЗаполнения</Name>
					<Comment>Правило заполнения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПравилаЗаполненияПолейПриТрансляции</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Приоритет</Name>
					<Comment>Приоритет</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>УсловиеВхождения</Name>
					<Comment>Условие вхождения</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_Кроме</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Источник</Name>
					<Comment>Источник</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Приемник</Name>
					<Comment>Приемник</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектСистемы</Name>
					<Comment>Объект системы</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

bit-finance/InformationRegisters/бит_УдалитьНазначениеПравилЗаполненияПолейПриТрансляции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_УдалитьНазначениеПравилЗаполненияПолейПриТрансляции</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоИсключение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УсловиеПрименения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПользовательскиеУсловия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПравилоЗаполнения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПравилаЗаполненияПолейПриТрансляции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектСистемы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

bit-finance/Enums/бит_Кроме.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_Кроме</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Кроме</Name>
					<Comment>Кроме</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

bit-finance/InformationRegisters/бит_УдалитьНазначениеПравилЗаполненияПриТрансляции/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

Процедура ПеренестиНастройкиПриПереходеНаНовуюВерсию() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УдалитьНазначениеПравилЗаполненияПриТрансляции.Источник КАК Источник,
	|	УдалитьНазначениеПравилЗаполненияПриТрансляции.Приемник КАК Приемник,
	|	УдалитьНазначениеПравилЗаполненияПриТрансляции.ОбъектСистемы КАК ОбъектСистемы,
	|	УдалитьНазначениеПравилЗаполненияПриТрансляции.ПравилоЗаполнения КАК ПравилоЗаполнения,
	|	УдалитьНазначениеПравилЗаполненияПриТрансляции.Приоритет КАК Приоритет,
	|	УдалитьНазначениеПравилЗаполненияПриТрансляции.УсловиеВхождения = ЗНАЧЕНИЕ(Перечисление.бит_Кроме.Кроме) КАК ЭтоИсключение,
	|	ДАТАВРЕМЯ(2000, 1, 1) КАК Период,
	|	ПРЕДСТАВЛЕНИЕ(УдалитьНазначениеПравилЗаполненияПриТрансляции.Источник) КАК ИсточникПредставление,
	|	ПРЕДСТАВЛЕНИЕ(УдалитьНазначениеПравилЗаполненияПриТрансляции.Приемник) КАК ПриемникПредставление,
	|	ПРЕДСТАВЛЕНИЕ(УдалитьНазначениеПравилЗаполненияПриТрансляции.ОбъектСистемы) КАК ОбъектСистемыПредставление
	|ИЗ
	|	РегистрСведений.бит_УдалитьНазначениеПравилЗаполненияПриТрансляции КАК УдалитьНазначениеПравилЗаполненияПриТрансляции
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_УдалитьНазначениеПравилЗаполненияПолейПриТрансляции КАК НазначениеПравилЗаполненияПолейПриТрансляции
	|		ПО УдалитьНазначениеПравилЗаполненияПриТрансляции.ОбъектСистемы = НазначениеПравилЗаполненияПолейПриТрансляции.ОбъектСистемы
	|			И УдалитьНазначениеПравилЗаполненияПриТрансляции.ПравилоЗаполнения = НазначениеПравилЗаполненияПолейПриТрансляции.ПравилоЗаполнения
	|ГДЕ
	|	НазначениеПравилЗаполненияПолейПриТрансляции.ПравилоЗаполнения ЕСТЬ NULL";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка			 = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		Попытка
			
			НаборЗаписей = РегистрыСведений.бит_УдалитьНазначениеПравилЗаполненияПолейПриТрансляции.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ОбъектСистемы.Установить(Выборка.ОбъектСистемы);
			НаборЗаписей.Отбор.ПравилоЗаполнения.Установить(Выборка.ПравилоЗаполнения);
			
			ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Выборка);
						
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			
			ПредставлениеЗаписи = НСтр("ru = '%1, %2, %3'");
			ПредставлениеЗаписи = СтрШаблон(ПредставлениеЗаписи, Выборка.ИсточникПредставление, 
									Выборка.ПриемникПредставление, Выборка.ОбъектСистемыПредставление);
			
			ТекстСообщения = НСтр("ru = 'Не удалось обработать запись: %1 по причине:
									|%2'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ПредставлениеЗаписи, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), 
				УровеньЖурналаРегистрации.Предупреждение,
				Метаданные.РегистрыСведений.бит_УдалитьНазначениеПравилЗаполненияПриТрансляции,, ТекстСообщения);
		КонецПопытки;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
